# -*- coding: utf-8 -*-

# (if/elif/else)

# По номеру месяца вывести кол-во дней в нем (без указания названия месяца, в феврале 28 дней)
# Результат проверки вывести на консоль
# Если номер месяца некорректен - сообщить об этом

# Номер месяца получать от пользователя следующим образом
user_input = input("Введите, пожалуйста, номер месяца: ")
month = int(user_input)
print('Вы ввели', month)

result = 28
months = {
    1: 'Январь',
    2: 'Февраль',
    3: 'Март',
    4: 'Апрель',
    5: 'Май',
    6: 'Июнь',
    7: 'Июль',
    8: 'Август',
    9: 'Сентабрь',
    10: 'Октябрь',
    11: 'Ноябрь',
    12: 'Декабрь',
 }
if month in (1, 3, 5, 7, 8, 10, 12):
    result = 31
elif month in (4, 6, 9, 11):
    result = 30
print('Ваш месяц ', months[month], 'количество дней', result)
